In [1]:
import pandas as pd

In [2]:
dict1 = {
    'Name':['Prathmesh','Jack','Ram','Roman','Sita','Kirti','aryanshi','Rustom','Nikhil'],
    'Marks':[98,89,78,79,76,5,63,36,34],
    'Gender':['male','male','male','male','female','female','female','male','male']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

        Name  Marks  Gender
0  Prathmesh     98    male
1       Jack     89    male
2        Ram     78    male
3      Roman     79    male
4       Sita     76  female
5      Kirti      5  female
6   aryanshi     63  female
7     Rustom     36    male
8     Nikhil     34    male

## display top 3 records

In [5]:
df.head(3)

        Name  Marks Gender
0  Prathmesh     98   male
1       Jack     89   male
2        Ram     78   male

## display last 3 rows

In [6]:
df.tail(3)

       Name  Marks  Gender
6  aryanshi     63  female
7    Rustom     36    male
8    Nikhil     34    male

## find shape

In [7]:
df.shape

(9, 3)

## get information about our dataset

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      object
 1   Marks   9 non-null      int64
 2   Gender  9 non-null      object
dtypes: int64(1), object(2)
memory usage: 344.0+ bytes

In [9]:
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False
7  False  False   False
8  False  False   False

In [10]:
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [11]:
df.sum()

Name      PrathmeshJackRamRomanSitaKirtiaryanshiRustomNi...
Marks                                                   558
Gender           malemalemalemalefemalefemalefemalemalemale
dtype: object

In [12]:
df.sum(axis=1)

C:\Users\W10\AppData\Local\Temp\ipykernel_17376\1459321664.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)

0    98
1    89
2    78
3    79
4    76
5     5
6    63
7    36
8    34
dtype: int64

In [13]:
df

        Name  Marks  Gender
0  Prathmesh     98    male
1       Jack     89    male
2        Ram     78    male
3      Roman     79    male
4       Sita     76  female
5      Kirti      5  female
6   aryanshi     63  female
7     Rustom     36    male
8     Nikhil     34    male

In [14]:
df['Marks'].sum()

558

## get overall statistics

In [15]:
df.describe()

           Marks
count   9.000000
mean   62.000000
std    30.569593
min     5.000000
25%    36.000000
50%    76.000000
75%    79.000000
max    98.000000

In [16]:
df.describe(include='all')

             Name      Marks Gender
count           9   9.000000      9
unique          9        NaN      2
top     Prathmesh        NaN   male
freq            1        NaN      6
mean          NaN  62.000000    NaN
std           NaN  30.569593    NaN
min           NaN   5.000000    NaN
25%           NaN  36.000000    NaN
50%           NaN  76.000000    NaN
75%           NaN  79.000000    NaN
max           NaN  98.000000    NaN

In [17]:
df['Name'].unique()

array(['Prathmesh', 'Jack', 'Ram', 'Roman', 'Sita', 'Kirti', 'aryanshi',
       'Rustom', 'Nikhil'], dtype=object)

In [18]:
x = df['Gender'].nunique()
y = df['Gender'].unique()

len(y)

2

In [19]:
df.value_counts()

Name       Marks  Gender
Jack       89     male      1
Kirti      5      female    1
Nikhil     34     male      1
Prathmesh  98     male      1
Ram        78     male      1
Roman      79     male      1
Rustom     36     male      1
Sita       76     female    1
aryanshi   63     female    1
dtype: int64

In [20]:
df['Gender'].value_counts()

male      6
female    3
Name: Gender, dtype: int64

In [21]:
df[df['Marks']>90]

        Name  Marks Gender
0  Prathmesh     98   male

In [22]:
(df[df['Marks']>80])

        Name  Marks Gender
0  Prathmesh     98   male
1       Jack     89   male

In [23]:
df['Marks'].between(80,90)

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
Name: Marks, dtype: bool

In [24]:
df['Marks'].mean()

62.0

In [25]:
def marksDivideByTwo(x):
    return x//2

In [26]:
df['half_marks'] = df['Marks'].apply(marksDivideByTwo)

In [27]:
df

        Name  Marks  Gender  half_marks
0  Prathmesh     98    male          49
1       Jack     89    male          44
2        Ram     78    male          39
3      Roman     79    male          39
4       Sita     76  female          38
5      Kirti      5  female           2
6   aryanshi     63  female          31
7     Rustom     36    male          18
8     Nikhil     34    male          17

In [28]:
df['Marks'].apply(lambda x: x+2)

0    100
1     91
2     80
3     81
4     78
5      7
6     65
7     38
8     36
Name: Marks, dtype: int64

In [29]:
df

        Name  Marks  Gender  half_marks
0  Prathmesh     98    male          49
1       Jack     89    male          44
2        Ram     78    male          39
3      Roman     79    male          39
4       Sita     76  female          38
5      Kirti      5  female           2
6   aryanshi     63  female          31
7     Rustom     36    male          18
8     Nikhil     34    male          17

In [30]:
df.drop('half_marks',axis=1)

        Name  Marks  Gender
0  Prathmesh     98    male
1       Jack     89    male
2        Ram     78    male
3      Roman     79    male
4       Sita     76  female
5      Kirti      5  female
6   aryanshi     63  female
7     Rustom     36    male
8     Nikhil     34    male

In [31]:
df[['Name','Gender']]

        Name  Gender
0  Prathmesh    male
1       Jack    male
2        Ram    male
3      Roman    male
4       Sita  female
5      Kirti  female
6   aryanshi  female
7     Rustom    male
8     Nikhil    male

In [32]:
df.columns

Index(['Name', 'Marks', 'Gender', 'half_marks'], dtype='object')

In [33]:
x = df.index

In [34]:
x[1]

1

In [35]:
df

        Name  Marks  Gender  half_marks
0  Prathmesh     98    male          49
1       Jack     89    male          44
2        Ram     78    male          39
3      Roman     79    male          39
4       Sita     76  female          38
5      Kirti      5  female           2
6   aryanshi     63  female          31
7     Rustom     36    male          18
8     Nikhil     34    male          17

In [36]:
df['Name'].str.contains('Pra')
df['Name'].str.contains('pra',case=False)

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
Name: Name, dtype: bool

In [37]:
df['Name'].str.upper()

0    PRATHMESH
1         JACK
2          RAM
3        ROMAN
4         SITA
5        KIRTI
6     ARYANSHI
7       RUSTOM
8       NIKHIL
Name: Name, dtype: object

In [38]:
df2 = pd.read_csv('C:/Users/W10/Desktop/sparkTxt/salaries.csv')

In [39]:
df2

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [40]:
df2['JobTitle'].str.upper()

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148649                                         CUSTODIAN
148650                                      NOT PROVIDED
148651                                      NOT PROVIDED
148652                                      NOT PROVIDED
148653                        COUNSELOR, LOG CABIN RANCH
Name: JobTitle, Length: 148654, dtype: object

In [41]:
df2['JobTitle'].str.contains('captain',case=False)

0         False
1          True
2          True
3         False
4         False
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: JobTitle, Length: 148654, dtype: bool

In [42]:
df2.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [43]:
df2['BasePay'].describe()

count    148045.000000
mean      66325.448840
std       42764.635495
min        -166.010000
25%       33588.200000
50%       65007.450000
75%       94691.050000
max      319275.010000
Name: BasePay, dtype: float64

In [44]:
df2['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650         Not provided
148651         Not provided
148652         Not provided
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

In [45]:
import numpy as np
df2['EmployeeName'].replace('Not provided',np.nan)

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650                  NaN
148651                  NaN
148652                  NaN
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

In [46]:
x=df2.isnull()==5

x.count()

Id                  148654
EmployeeName        148654
JobTitle            148654
BasePay             148654
OvertimePay         148654
OtherPay            148654
Benefits            148654
TotalPay            148654
TotalPayBenefits    148654
Year                148654
Notes               148654
Agency              148654
Status              148654
dtype: int64

In [47]:
df2.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [49]:
df2['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [51]:
df3 = df2[df2['JobTitle']=='WIRE ROPE CABLE MAINTENANCE MECHANIC']

In [52]:
df3['JobTitle'].unique()

array(['WIRE ROPE CABLE MAINTENANCE MECHANIC'], dtype=object)